// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому
// 3 і більше елементи.
// Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if (friends.length >= 4) {
//     console.log('це великий масив')
// } else if (friends.length <= 3)
//     console.log('це маленький масив')


// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше).
//     Перевірити, чи знаходиться перше число між двома іншими.

// let x = 6;
// let y = 8;
// let z = 18;

// if((y>x && y<z) || (y>z && y<x )){
//     console.log('center y')
// }else if(y<x && y<z){
//     console.log('left')
// }else if(y>x && y>z)
//     console.log('right')


//     - Перепишіть конструкцію if з використанням умовного оператора '?':
// // let result;
// // if (a + b < 4) {
// //     result = 'Мало';
// // } else {
// //     result = 'Багато';
// // }

// let a = 2;
// let b = 3;
// let result = a + b;
// result < 4 ? console.log('Мало') : console.log('Багато');


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// let number = prompt('what number?')
//
// let value = (number > -100 && number < 0) ? 'негативнe' :
//     (number === 0) ? 'нуль' :
//         (number > 0 && number < 100) ? 'позитивнe' : 'unavalaible';
//
// console.log(value)